Revit 2024 API
IFCGeometryInfo Members
The IFCGeometryInfo type exposes the following members.
Methods
Name | Description
CreateCurveGeometryInfo
 Creates a new container object which holds IfcCurve handles processed from a Revit geometry object.
CreateFaceGeometryInfo(Double)
 Creates a new container object which holds IfcFace handles processed from a Revit geometry object.
CreateFaceGeometryInfo(Double, Boolean)
 Creates a new container object which holds IfcFace handles processed from a Revit geometry object.
CreateFaceGeometryInfo(ExporterIFC, Plane, XYZ, Double, Boolean)
 Creates a new container object which holds IfcFace handles processed from a Revit geometry object.
CreateSurfaceGeometryInfo
 Creates a new container object which holds IfcSurface handles processed from a Revit geometry object.
Dispose
Releases all resources used by the IFCGeometryInfo
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetCurves
 Gets the IfcCurve handles created representing the processed geometry and stored in this object.
GetFaces
 Gets the IfcFace handles created representing the processed geometry and stored in this object.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetRepresentations
 Gets the representation handles created representing the processed geometry and stored in this object.
GetSurfaces
 Gets the IfcSurface handles created representing the processed geometry and stored in this object.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
IFCGeometryInfo Class
Autodesk.Revit.DB.IFC Namespace